# Lesson 3
* Indexes
* Joins
* Concatenations
# Setup

In [1]:
%pip install pandas
%pip install numpy
%pip install matplotlib
%pip install seaborn

Requirement already satisfied: pandas in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (1.4.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from pandas) (1.23.0)
Requirement already satisfied: six>=1.5 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: numpy in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (1.23.0)
Note: you may need to restart the kernel to use updated packages.
Collecting matplotlib
  Downloading matplotlib-3.5.2-cp310-cp310-win_amd64.whl (7.2 MB)
Requirement already satisfied: numpy>=1.17 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib) (1.23.0)
Collecting fonttools>=4.22.0
  Downloading fonttools-4.33.3-py3-none-any.whl (930 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib) (21.3)
Collecting pillow>=6.2.0
  Downloading Pillow-9.2.0-cp310-cp310-win_amd64.whl (3.3 MB)
Collecting kiwisolver>=1.0.1
  Downloading kiwisolver-1.4.3-cp310-cp310-win_amd64.whl (55 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib) (3.0.9)
Collecting cycler>=0.10
  Using cached cycler-0.11.0-py3-none-any.whl (6.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Installing collected packages: pillow, kiwisolver, fonttools, cycler, matplotlib
Successfully installed cycler-0.11.0 fonttools-4.33.3 kiwisolver-1.4.3 matplotlib-3.5.2 pillow-9.2.0
Note: you may need to restart the kernel to use updated packages.
Collecting seabornNote: you may need to restart the kernel to use updated packages.

  Using cached seaborn-0.11.2-py3-none-any.whl (292 kB)
Requirement already satisfied: matplotlib>=2.2 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from seaborn) (3.5.2)
Collecting scipy>=1.0
  Downloading scipy-1.8.1-cp310-cp310-win_amd64.whl (36.9 MB)
Requirement already satisfied: pandas>=0.23 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from seaborn) (1.4.3)
Requirement already satisfied: numpy>=1.15 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from seaborn) (1.23.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.9)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (1.4.3)
Requirement already satisfied: packaging>=20.0 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: cycler>=0.10 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (4.33.3)
Requirement already satisfied: pillow>=6.2.0 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from matplotlib>=2.2->seaborn) (9.2.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from pandas>=0.23->seaborn) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\lucas\anaconda3\envs\data-science-notebook\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)
Installing collected packages: scipy, seaborn
Successfully installed scipy-1.8.1 seaborn-0.11.2

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn

# Data
## Indexes

In [3]:
# Indexes are the margin names of rows and columns
df1 = pd.DataFrame([
    {'Name': 'Walter', 'Surname': 'White'},
    {'Name': 'Hank', 'Surname': 'Schrader'},
    {'Name': 'Jesse', 'Surname': 'Pinkman'},
    {'Name': 'Saul', 'Surname': 'Goodman'}
])
df1

     Name   Surname
0  Walter     White
1    Hank  Schrader
2   Jesse   Pinkman
3    Saul   Goodman

### Set

In [4]:
# We can set the index
df1.set_index('Name')

         Surname
Name
Walter     White
Hank    Schrader
Jesse    Pinkman
Saul     Goodman

In [5]:
# We can make multi-indexes
df1.set_index(['Name', 'Surname'])

Empty DataFrame
Columns: []
Index: [(Walter, White), (Hank, Schrader), (Jesse, Pinkman), (Saul, Goodman)]

### Reset

In [6]:
df1.reset_index()

   index    Name   Surname
0      0  Walter     White
1      1    Hank  Schrader
2      2   Jesse   Pinkman
3      3    Saul   Goodman

In [7]:
df1.reset_index(drop=True)

     Name   Surname
0  Walter     White
1    Hank  Schrader
2   Jesse   Pinkman
3    Saul   Goodman

## Join
* Construct two data frames
* Join & Concat

In [8]:
df1 = pd.DataFrame([
    {'Name': 'Walter'},
    {'Name': 'Hank'},
    {'Name': 'Jesse'},
    {'Name': 'Saul'}
])
df1

     Name
0  Walter
1    Hank
2   Jesse
3    Saul

In [9]:
df2 = pd.DataFrame([
    {'Surname': 'White'},
    {'Surname': 'Schrader'},
    {'Surname': 'Pinkman'},
    {'Surname': 'Goodman'}
])
df2

    Surname
0     White
1  Schrader
2   Pinkman
3   Goodman

### Join
* Match up rows and put frames together

In [10]:
# Use the data frame to join to another
# Join uses the index
df1.join(df2)

     Name   Surname
0  Walter     White
1    Hank  Schrader
2   Jesse   Pinkman
3    Saul   Goodman

### Index vs Column

In [11]:
df1 = pd.DataFrame([
    {'Name': 'Walter', 'Surname': 'White', 'Job': 'Entrepreneur'},
    {'Name': 'Hank', 'Surname': 'Schrader', 'Job': 'Law Enforcement'},
    {'Name': 'Jesse', 'Surname': 'Pinkman', 'Job': 'Entrepreneur'},
    {'Name': 'Saul', 'Surname': 'Goodman', 'Job': 'Lawyer'}
])
df1

     Name   Surname              Job
0  Walter     White     Entrepreneur
1    Hank  Schrader  Law Enforcement
2   Jesse   Pinkman     Entrepreneur
3    Saul   Goodman           Lawyer

In [12]:
df2 = pd.DataFrame([
    {'Job': 'Entrepreneur',     'Pay': 1_000_000},
    {'Job': 'Law Enforcement',  'Pay': 75_000},
    {'Job': 'Lawyer',           'Pay': 250_000},
    {'Job': 'Teacher',          'Pay': 50_000}
])
df2

               Job      Pay
0     Entrepreneur  1000000
1  Law Enforcement    75000
2           Lawyer   250000
3          Teacher    50000

In [13]:
# Cant join - there's a column the same
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['Job'], dtype='object')

In [ ]:
# Join the Job column in the first frame to the index in the second
df1.join(df2.set_index('Job'), on=['Job'])

## Inner, Left, Right, Outer

In [ ]:
# If we flip this around (from jobs -> people)
# We can see the default join tyle, left
df2.set_index('Job').join(df1.set_index('Job'))

                     Pay    Name   Surname
Job
Entrepreneur     1000000  Walter     White
Entrepreneur     1000000   Jesse   Pinkman
Law Enforcement    75000    Hank  Schrader
Lawyer            250000    Saul   Goodman
Teacher            50000     NaN       NaN

In [ ]:
# We can control the join using the how attribute
# Supports left, right, inner, outer
# Here we're showing an inner join
df2.set_index('Job').join(df1.set_index('Job'), how='inner')

                     Pay    Name   Surname
Job
Entrepreneur     1000000  Walter     White
Entrepreneur     1000000   Jesse   Pinkman
Law Enforcement    75000    Hank  Schrader
Lawyer            250000    Saul   Goodman

# Suffixes
* Sometimes, our join, results in common column names
* We could replace the existing names of columns
* But it could be helpful to suffix all common codes

In [ ]:
df1 = pd.DataFrame([
  {'Name': 'Walter', 'Surname': 'White',    'Job': 'Entrepreneur',    'Pay': 1_500_000},
  {'Name': 'Hank',   'Surname': 'Schrader', 'Job': 'Law Enforcement', 'Pay': 100_000},
  {'Name': 'Jesse',  'Surname': 'Pinkman',  'Job': 'Entrepreneur',    'Pay': 1_500_000},
  {'Name': 'Saul',   'Surname': 'Goodman',  'Job': 'Lawyer',          'Pay': 500_000},
])
df1

     Name   Surname              Job      Pay
0  Walter     White     Entrepreneur  1500000
1    Hank  Schrader  Law Enforcement   100000
2   Jesse   Pinkman     Entrepreneur  1500000
3    Saul   Goodman           Lawyer   500000

In [ ]:
df2 = pd.DataFrame([
  {'Job': 'Entrepreneur',    'Pay': 200_000},
  {'Job': 'Law Enforcement', 'Pay': 75_000},
  {'Job': 'Lawyer',          'Pay': 150_000},
  {'Job': 'Teacher',         'Pay': 50_000},
])
df2

               Job     Pay
0     Entrepreneur  200000
1  Law Enforcement   75000
2           Lawyer  150000
3          Teacher   50000

In [ ]:
# You can control the column names with suffixing
df1.join(df2.set_index('Job'), on=['Job'], lsuffix='_Current', rsuffix='_Typical')

     Name   Surname              Job  Pay_Current  Pay_Typical
0  Walter     White     Entrepreneur      1500000       200000
1    Hank  Schrader  Law Enforcement       100000        75000
2   Jesse   Pinkman     Entrepreneur      1500000       200000
3    Saul   Goodman           Lawyer       500000       150000